espruino/Espruino/targets/stm32/jshardware.c
/*  Pin pin = 1;
  jshPinOutput(pin, 1);
  jshInterruptOff();
  jshPinSetValue(pin, 0);
  jshDelayMicroseconds(100);
  jshPinSetValue(pin, 1);
  jshDelayMicroseconds(100);
  jshPinSetValue(pin, 0);
  jshDelayMicroseconds(100);
  jshPinSetValue(pin, 1);
  jshDelayMicroseconds(100);
  jshPinSetValue(pin, 0);
  jshDelayMicroseconds(100);
  jshPinSetValue(pin, 1);
  jshDelayMicroseconds(100);
  jshPinSetValue(pin, 0);
  jshDelayMicroseconds(100);
  jshPinSetValue(pin, 1);
  jshDelayMicroseconds(100);
  jshPinSetValue(pin, 0);
  jshDelayMicroseconds(100);
  jshPinSetValue(pin, 1);
  jshDelayMicroseconds(100);
  jshPinSetValue(pin, 0);
  jshDelayMicroseconds(100);
  jshPinSetValue(pin, 1);
  jshDelayMicroseconds(100);
  jshPinSetValue(pin, 0);
  jshDelayMicroseconds(200);
  jshPinSetValue(pin, 1);
  jshDelayMicroseconds(200);
  jshPinSetValue(pin, 0);
  jshDelayMicroseconds(1000);
  jshPinSetValue(pin, 1);
  jshDelayMicroseconds(1000);
  jshPinSetValue(pin, 0);
  jshInterruptOn();*/

  /* Enable Utility Timer Update interrupt. We'll enable the
   * utility timer when we need it. */
  NVIC_InitStructure.NVIC_IRQChannel = UTIL_TIMER_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = IRQ_PRIOR_MED;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);

  // reset SPI buffers
  for (i=0;i<SPIS;i++) {
    jshSPIBufHead[i] = 0;
    jshSPIBufTail[i] = 0;
  }

#ifdef LED1_PININDEX
  // now hardware is initialised, turn led off
  jshPinOutput(LED1_PININDEX, 0);
#endif
}

void jshKill() {
}

void jshIdle() {
#ifdef USB
  static bool wasUSBConnected = false;
  bool USBConnected = jshIsUSBSERIALConnected();
  if (wasUSBConnected != USBConnected) {
    wasUSBConnected = USBConnected;
    if (USBConnected)
      jsiSetConsoleDevice(EV_USBSERIAL);
    else {
      if (jsiGetConsoleDevice() == EV_USBSERIAL)
        jsiSetConsoleDevice(DEFAULT_CONSOLE_DEVICE);
      jshTransmitClearDevice(EV_USBSERIAL); // clear the transmit queue
    }
  }
#endif
}

// ----------------------------------------------------------------------------

int jshGetSerialNumber(unsigned char *data, int maxChars) {
  NOT_USED(maxChars); // bad :)
#if defined(STM32F1)
  __IO uint32_t *addr = (__IO uint32_t*)(0x1FFFF7E8);
#elif defined(STM32F3)
  __IO uint32_t *addr = (__IO uint32_t*)(0x1FFFF7AC);
#elif defined(STM32F2) || defined(STM32F4)
  __IO uint32_t *addr = (__IO uint32_t*)(0x1FFF7A10);
#else
#error No jshGetSerialNumber for this part!
#endif
  data[ 0] = (unsigned char)((addr[0]      ) & 0xFF);
  data[ 1] = (unsigned char)((addr[0] >>  8) & 0xFF);
  data[ 2] = (unsigned char)((addr[0] >> 16) & 0xFF);
  data[ 3] = (unsigned char)((addr[0] >> 24) & 0xFF);
  data[ 4] = (unsigned char)((addr[1]      ) & 0xFF);
  data[ 5] = (unsigned char)((addr[1] >>  8) & 0xFF);
  data[ 6] = (unsigned char)((addr[1] >> 16) & 0xFF);
  data[ 7] = (unsigned char)((addr[1] >> 24) & 0xFF);
  data[ 8] = (unsigned char)((addr[2]      ) & 0xFF);
  data[ 9] = (unsigned char)((addr[2] >>  8) & 0xFF);
  data[10] = (unsigned char)((addr[2] >> 16) & 0xFF);
  data[11] = (unsigned char)((addr[2] >> 24) & 0xFF);
  return 12;
}

// ----------------------------------------------------------------------------

bool jshIsUSBSERIALConnected() {
#ifdef USB
  return SysTickUSBWatchdog < SYSTICKS_BEFORE_USB_DISCONNECT;
  // not a check for connected - we just want to have some idea...
#else
  return false;
#endif
}

JsSysTime jshGetTimeFromMilliseconds(JsVarFloat ms) {
#ifdef USE_RTC
  return (JsSysTime)(ms*(JSSYSTIME_SECOND/(JsVarFloat)1000));
#else
  return (JsSysTime)((ms*getSystemTimerFreq())/1000);
#endif
}

JsVarFloat jshGetMillisecondsFromTime(JsSysTime time) {
#ifdef USE_RTC
  return (JsVarFloat)time*(1000/(JsVarFloat)JSSYSTIME_SECOND);
#else
  return ((JsVarFloat)time)*1000/getSystemTimerFreq();
#endif
}

#ifdef USE_RTC
JsSysTime jshGetRTCSystemTime() {
  uint16_t dl1 = RTC->DIVL;
  uint16_t ch1 = RTC->CNTH;
  uint16_t cl1 = RTC->CNTL;

  uint16_t dl2 = RTC->DIVL;
  uint16_t ch2 = RTC->CNTH;
  uint16_t cl2 = RTC->CNTL;

  if(cl1 == cl2) {
    // no overflow
    return ((JsSysTime)(ch2)<<(JSSYSTIME_RTC_SHIFT+8))|(cl2<<JSSYSTIME_RTC_SHIFT) | ((RTC_PRESCALER - dl2)<<JSSYSTIME_EXTRA_BITS);
  } else {
    // overflow, but prob didn't happen before
    return ((JsSysTime)(ch1)<<(JSSYSTIME_RTC_SHIFT+8))|(cl1<<JSSYSTIME_RTC_SHIFT) | ((RTC_PRESCALER - dl1)<<JSSYSTIME_EXTRA_BITS);
  }
}
#endif

JsSysTime jshGetSystemTime() {
#ifdef USE_RTC
  if (hasSystemSlept) {
    // reset SysTick counter. This will hopefully cause it
    // to fire off a SysTick IRQ, which will reset lastSysTickTime
    SysTick->VAL = 0; // this doesn't itself fire an IRQ it seems
    jshDoSysTick();
  }
  // Try and fix potential glitch caused by rollover of SysTick
  JsSysTime last1, last2;
  unsigned int avr1,avr2;
  unsigned int sysTick;
  do {
    avr1 = smoothAverageSysTickTime;
    last1 = smoothLastSysTickTime;
    sysTick = SYSTICK_RANGE - SysTick->VAL;
    last2 = smoothLastSysTickTime;
    avr2 = smoothAverageSysTickTime;
  } while (last1!=last2 || avr1!=avr2);
  // Now work out time...
  return last2 + (((JsSysTime)sysTick*(JsSysTime)avr2)/SYSTICK_RANGE);
#else
  JsSysTime major1, major2, major3, major4;
  unsigned int minor;
  do {
    major1 = SysTickMajor;
    major2 = SysTickMajor;
    minor = SysTick->VAL;
    major3 = SysTickMajor;
    major4 = SysTickMajor;
  } while (major1!=major2 || major2!=major3 || major3!=major4);
  return major1 - (JsSysTime)minor;
#endif
}

// ----------------------------------------------------------------------------

bool jshPinInput(Pin pin) {
  bool value = false;
  if (jshIsPinValid(pin)) {
    if (!jshGetPinStateIsManual(pin)) 
      jshPinSetState(pin, JSHPINSTATE_GPIO_IN);

    value = jshPinGetValue(pin);
  } else jsError("Invalid pin!");
  return value;
}

static unsigned char jshADCInitialised = 0;

static NO_INLINE JsVarFloat jshAnalogRead(JsvPinInfoAnalog analog) {
  ADC_TypeDef *ADCx = stmADC(analog);
    bool needs_init = false;
    if (ADCx == ADC1) {
      if (!(jshADCInitialised&1)) {
        jshADCInitialised |= 1;
        needs_init = true;
        #if defined(STM32F3)
          RCC_AHBPeriphClockCmd( RCC_AHBPeriph_ADC12, ENABLE);
        #elif defined(STM32F4)
          RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
        #else
          RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
        #endif
      }
    } else if (ADCx == ADC2) {
      if (!(jshADCInitialised&1)) {
        jshADCInitialised |= 1;
        needs_init = true;
        #if defined(STM32F3)
          RCC_AHBPeriphClockCmd( RCC_AHBPeriph_ADC12, ENABLE);
        #elif defined(STM32F4)
          RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC2, ENABLE);
        #else
          RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC2, ENABLE);
        #endif
      }
    } else if (ADCx == ADC3) {
      if (!(jshADCInitialised&4)) {
        jshADCInitialised |= 4;
        needs_init = true;
        #if defined(STM32F3)
          RCC_AHBPeriphClockCmd( RCC_AHBPeriph_ADC34, ENABLE);
        #elif defined(STM32F4)
          RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC3, ENABLE);
        #else
          RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC3, ENABLE);
        #endif
      }
  #if ADCS>3
    } else if (ADCx == ADC4) {
      if (!(jshADCInitialised&8)) {
        jshADCInitialised |= 8;
        needs_init = true;
        #if defined(STM32F3)
          RCC_AHBPeriphClockCmd( RCC_AHBPeriph_ADC34, ENABLE);
        #elif defined(STM32F4)
          RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC4, ENABLE);
        #else
          RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC4, ENABLE);
        #endif
      }
  #endif
    } else {
      jsErrorInternal("couldn't find ADC!");
      return -1;
    }

    if (needs_init) {
  #ifdef STM32F3
      ADC_CommonInitTypeDef ADC_CommonInitStructure;
      ADC_CommonStructInit(&ADC_CommonInitStructure);
      ADC_CommonInitStructure.ADC_Mode          = ADC_Mode_Independent;
      ADC_CommonInitStructure.ADC_Clock         = ADC_Clock_SynClkModeDiv2;
      ADC_CommonInitStructure.ADC_DMAAccessMode     = ADC_DMAAccessMode_Disabled;
      ADC_CommonInitStructure.ADC_TwoSamplingDelay          = ADC_SampleTime_1Cycles5;
      ADC_CommonInit(ADCx, &ADC_CommonInitStructure);
  #endif

      // ADC Structure Initialization
      ADC_InitTypeDef ADC_InitStructure;
      ADC_StructInit(&ADC_InitStructure);
      // Preinit
      ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
      ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Left;
    #ifndef STM32F3
      ADC_InitStructure.ADC_ScanConvMode = DISABLE;
    #if defined(STM32F2) || defined(STM32F4)
      ADC_InitStructure.ADC_ExternalTrigConvEdge        = ADC_ExternalTrigConvEdge_None;
    #else
      ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
      ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
      ADC_InitStructure.ADC_NbrOfChannel = 1;
    #endif
    #endif
      ADC_Init(ADCx, &ADC_InitStructure);

